[
  {
    "id": 1,
    "title": "Batman: The Dark Knight Returns",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/7/77/Dark_knight_returns.jpg",
    "publisher": "DC",
    "characters": ["Batman", "Joker"],
    "genre": "Superhero",
    "release_date": "2021-06-10",
    "description": "Ten years after he retired, Batman is back. A new breed of criminal has infected Gotham City, and the Dark Knight is needed to battle a wave of crime and corruption. His return sets him on a collision course with a revitalized Joker and a former ally, as he fights to save the city one last time, even if it means confronting the U.S. government and Superman himself.",
    "price": 1246
  },
  {
    "id": 2,
    "title": "Superman: Red Son",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/d/dd/Supermanredson.jpg",
    "publisher": "DC",
    "characters": ["Superman"],
    "genre": "Alternate Universe",
    "release_date": "2019-02-12",
    "description": "In this Elseworlds tale, Superman's rocket ship lands in the Soviet Union instead of Kansas, leading to a Soviet-era reimagining where the Man of Steel is a champion of communism and the Cold War landscape is dramatically altered. As the United States struggles to counter the Soviet Superman, Lex Luthor becomes America's last hope, while other familiar heroes and villains appear in radically different roles within this alternate timeline.",
    "price": 1038
  },
  {
    "id": 3,
    "title": "Wonder Woman: Warbringer",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/3/3a/Wonder_Woman_Vol_5_16.png",
    "publisher": "DC",
    "characters": ["Wonder Woman"],
    "genre": "Fantasy",
    "release_date": "2020-11-20",
    "description": "Diana, Princess of the Amazons, must risk her peaceful life on Themyscira when she violates a sacred Amazonian law to save Alia, a mortal girl. Alia is a Warbringer, a direct descendant of Helen of Troy, whose presence is prophesied to bring about a devastating war. Together, Diana and Alia must outrun both mythical forces and mortal hunters to prevent an ancient war from engulfing the modern world, testing the bounds of Diana's compassion and courage.",
    "price": 995
  },
  {
    "id": 4,
    "title": "The Flash: Rebirth",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/1/17/The_Flash_Rebirth_%28hardcover_collection%29.jpg",
    "publisher": "DC",
    "characters": ["The Flash"],
    "genre": "Superhero",
    "release_date": "2022-01-12",
    "description": "Barry Allen, the Silver Age Flash, has returned from the grave, but his joyous reunion is short-lived. A dark force is tethered to the Speed Force, threatening to destroy not only him but also his legacy and everyone connected to the speedsters. Barry must confront the mysteries surrounding his return and the true nature of the Speed Force, as he is drawn into a conflict that reveals the identity of the dark speedster responsible for years of tragedy in his life.",
    "price": 1119
  },
  {
    "id": 5,
    "title": "Aquaman: Throne of Atlantis",
    "poster_url": "https://m.media-amazon.com/images/I/61JkZvEv-zL._SY445_SX342_FMwebp_.jpg",
    "publisher": "DC",
    "characters": ["Aquaman"],
    "genre": "Action",
    "release_date": "2021-09-30",
    "description": "When a devastating attack on the surface world is linked to the underwater kingdom of Atlantis, the world is on the brink of an all-out war. Aquaman, torn between the two worlds, must uncover the truth behind the assaults and stop his Atlantean half-brother, Orm, the Ocean Master, from leading an invasion. As he fights to protect both the surface world and his people, Aquaman must embrace his destiny as the rightful king of Atlantis to prevent global catastrophe.",
    "price": 1327
  },
  {
    "id": 6,
    "title": "Spider-Man: Into the Spider-Verse",
    "poster_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJ8zNd0C55lkN8eeiTBi6FqBqMASYakXQycPzMI3Yyp7VOxauNZ9AbHjt0awZvsm8ubQTx-Q&s=10",
    "publisher": "Marvel",
    "characters": ["Spider-Man", "Miles Morales"],
    "genre": "Superhero",
    "release_date": "2022-05-05",
    "description": "After a disastrous experiment with a particle collider, teenager Miles Morales is bitten by a radioactive spider and gains powers similar to the legendary Spider-Man. The collider also rips open portals to alternate realities, bringing different versions of Spider-Man from across the multiverse into Miles' world. Miles must team up with these parallel universe heroes, including a jaded Peter B. Parker, to defeat the villain Kingpin and find a way to send everyone back to their own dimension, all while learning what it truly means to wear the mask.",
    "price": 1161
  },
  {
    "id": 7,
    "title": "Iron Man: Extremis",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/7/7c/Iron_Man_Extremis.jpg",
    "publisher": "Marvel",
    "characters": ["Iron Man"],
    "genre": "Sci-Fi",
    "release_date": "2020-08-18",
    "description": "Tony Stark is faced with a new, terrifying threat: a terrorist has ingested a powerful techno-organic virus called Extremis, granting him superhuman abilities. To defeat this foe, Stark is forced to inject himself with a refined version of the Extremis serum, radically overhauling his abilities and connection to his Iron Man armor. This transformation not only grants him unprecedented control over technology but also challenges his very definition of what it means to be Iron Man and how he uses his power.",
    "price": 1204
  },
  {
    "id": 8,
    "title": "Captain America: Winter Soldier",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/8/87/CaptainAmericaVol5Iss14.png",
    "publisher": "Marvel",
    "characters": ["Captain America", "Bucky Barnes"],
    "genre": "Action",
    "release_date": "2021-12-01",
    "description": "Captain America is ambushed by a mysterious assassin known as the Winter Soldier, who is eerily familiar with Cap's fighting style. As he investigates the identity of this ghost from his past, Steve Rogers must confront the shocking truth: the Winter Soldier is none other than his long-lost sidekick, Bucky Barnes, who was brainwashed by the Soviet Union. This discovery shakes the very foundation of Cap's moral code and forces him into a deeply personal battle to save his oldest friend.",
    "price": 1328
  },
  {
    "id": 9,
    "title": "Thor: God of Thunder",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/1/17/Thor_by_Olivier_Coipel.png",
    "publisher": "Marvel",
    "characters": ["Thor"],
    "genre": "Mythology",
    "release_date": "2023-07-22",
    "description": "Across the vastness of space and time, gods are disappearing, and the trail of blood leads to one killer: Gorr, the God Butcher. This epic saga follows three versions of Thor—the young, unworthy Viking; the Avengers-era Avenger; and the elderly, embattled King of Asgard—as they fight a battle across millennia against Gorr, a being with an insatiable need to see all gods perish. Thor must delve into the darkest corners of his history and mythology to save the pantheons from a threat greater than any he has ever faced.",
    "price": 1493
  },
  {
    "id": 10,
    "title": "The Incredible Hulk: Planet Hulk",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/9/93/The_Incredible_Hulk_1_%28May_1962%29.jpg",
    "publisher": "Marvel",
    "characters": ["Hulk"],
    "genre": "Sci-Fi",
    "release_date": "2019-04-10",
    "description": "Deemed too dangerous for Earth, the Illuminati, a cabal of the world's most powerful heroes, trick the Hulk into a space shuttle and exile him to a peaceful alien world. However, the shuttle is diverted, and the Hulk crashes on the hostile planet Sakaar, where he is captured and forced into gladiator servitude. Stripped of his identity and forced to fight for his life, the Hulk unites fellow slaves into a powerful rebellion, ultimately becoming their legendary 'Green Scar' and king of the broken world.",
    "price": 1246
  },
  {
    "id": 11,
    "title": "Attack on Titan Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/d/d6/Shingeki_no_Kyojin_manga_volume_1.jpg",
    "publisher": "Shueisha",
    "characters": ["Eren", "Mikasa", "Armin"],
    "genre": "Dark Fantasy",
    "release_date": "2018-11-11",
    "description": "For over a century, humanity has lived in fear behind enormous concentric walls to protect themselves from the Titans, gigantic, man-eating humanoid creatures. When a Colossal Titan and the Armored Titan suddenly appear and breach the outermost wall, the Titans pour in, devastating the city and claiming countless lives. Eren Yeager, a young boy who witnesses his mother's death, vows to join the Survey Corps and exterminate every last Titan, starting a journey of brutal battles and shocking discoveries about the nature of the walls and the Titans themselves.",
    "price": 829
  },
  {
    "id": 12,
    "title": "Naruto Vol. 1",
    "poster_url": "https://cmsapi-frontend.naruto-official.com/site/api/naruto/Image/get?path=/naruto/en/comics/2022/09/29/RqRC69jCy2qPhxeH/cover.jpg",
    "publisher": "Shueisha",
    "characters": ["Naruto", "Sasuke", "Sakura"],
    "genre": "Adventure",
    "release_date": "2014-09-18",
    "description": "Meet Naruto Uzumaki, a rambunctious, noisy, and mischievous ninja-in-training who is an outcast in his village due to a dark secret he carries. Despite being scorned, Naruto is determined to become the Hokage, the strongest ninja and leader of the Hidden Leaf Village, to earn the respect and love of his people. Along with his brilliant rival Sasuke Uchiha and the intelligent Sakura Haruno, they form Team 7 under the mysterious Kakashi Sensei, beginning a journey of rigorous training, perilous missions, and intense self-discovery.",
    "price": 746
  },
  {
    "id": 13,
    "title": "Demon Slayer Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/0/09/Demon_Slayer_-_Kimetsu_no_Yaiba%2C_volume_1.jpg",
    "publisher": "Shueisha",
    "characters": ["Tanjiro", "Nezuko"],
    "genre": "Dark Fantasy",
    "release_date": "2021-02-23",
    "description": "After his family is brutally slaughtered by demons, kind-hearted Tanjiro Kamado discovers that his younger sister, Nezuko, is the sole survivor but has been transformed into a demon herself. Vowing to find a cure for his sister and avenge his family, Tanjiro sets out on a perilous journey to become a Demon Slayer. His path is fraught with danger, as he must train in the ways of the blade and confront the supernatural horrors of a world where demons lurk in the shadows, all while struggling to protect the last piece of his family.",
    "price": 912
  },
  {
    "id": 14,
    "title": "One Piece Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/518KKkmd1fL._SY445_SX342_FMwebp_.jpg",
    "publisher": "Shueisha",
    "characters": ["Luffy", "Zoro", "Nami"],
    "genre": "Adventure",
    "release_date": "2019-07-26",
    "description": "Monkey D. Luffy, a boy who ate a Devil Fruit and gained the ability to stretch like rubber, dreams of following in the footsteps of his hero, the pirate Red-Haired Shanks. His ultimate goal is to find the legendary treasure known as the One Piece and become the King of the Pirates. Gathering a crew of diverse and colorful characters, including the master swordsman Roronoa Zoro and the brilliant navigator Nami, Luffy sets sail on the high seas, beginning a grand, epic adventure filled with battles against powerful foes, exploration of strange islands, and the pursuit of freedom.",
    "price": 788
  },
  {
    "id": 15,
    "title": "Jujutsu Kaisen Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/51CcaF9O78L._SY445_SX342_FMwebp_.jpg",
    "publisher": "Shueisha",
    "characters": ["Yuji Itadori", "Gojo"],
    "genre": "Supernatural",
    "release_date": "2022-04-12",
    "description": "Ordinary high school student Yuji Itadori possesses immense physical strength but has no interest in sports, preferring to hang out with the Occult Research Club. His life takes a drastic turn when he encounters a genuine cursed object—the rotten finger of the King of Curses, Sukuna. To save his friends and exorcise the creatures known as Curses, Yuji swallows the finger and becomes the host to Sukuna. Now, under the guidance of Jujutsu sorcerer Satoru Gojo, Yuji is enrolled in the Tokyo Metropolitan Curse Technical School and thrust into a dangerous world of supernatural combat and death-defying missions.",
    "price": 873
  },
  {
    "id": 16,
    "title": "My Hero Academia Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/5/5a/Boku_no_Hero_Academia_Volume_1.png",
    "publisher": "Shueisha",
    "characters": ["Deku", "Bakugo", "All Might"],
    "genre": "Superhero",
    "release_date": "2020-01-10",
    "description": "In a world where almost everyone is born with a superpower, or 'Quirk,' Izuku Midoriya is one of the rare few born completely Quirkless. Despite this setback, Izuku dreams of becoming a hero, idolizing the world's greatest hero, All Might. His life changes forever when a chance encounter with All Might leads the hero to choose Izuku as his successor and pass down his own unique Quirk, 'One For All.' Izuku enrolls in the prestigious U.A. High School, where he must train his new powers and learn to control them alongside his competitive rival, Katsuki Bakugo, all while facing the growing threat of powerful villains.",
    "price": 829
  },
  {
    "id": 17,
    "title": "Bleach Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/3/3f/Bleach_%28manga%29_1.png",
    "publisher": "Shueisha",
    "characters": ["Ichigo Kurosaki"],
    "genre": "Supernatural",
    "release_date": "2016-11-19",
    "description": "Ichigo Kurosaki is an ordinary high school student with one extraordinary ability: he can see ghosts. His life is turned upside down when he meets Rukia Kuchiki, a Soul Reaper—a spirit who guides souls to the afterlife and purifies evil spirits known as Hollows. During a Hollow attack on his family, Rukia is injured and is forced to transfer her powers to Ichigo. Now a temporary Soul Reaper, Ichigo must take up her duty of protecting the innocent and guiding the dead, navigating a hidden world of spirits and swords.",
    "price": 746
  },
  {
    "id": 18,
    "title": "Dragon Ball Super Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/4/43/Dragon_Ball_Super_Volume_1.png",
    "publisher": "Shueisha",
    "characters": ["Goku", "Vegeta"],
    "genre": "Action",
    "release_date": "2019-02-02",
    "description": "The peace on Earth, established after the defeat of the evil Majin Buu, is short-lived as a new and formidable threat arises: Beerus, the God of Destruction. Awakened from a long slumber, Beerus is searching for the Super Saiyan God, a being of legendary power. Goku and Vegeta must push past their limits and achieve divine transformations to challenge Beerus and protect their world. This new saga takes the heroes on adventures across different universes, introducing powerful new characters and gods, and raising the stakes of their already legendary battles.",
    "price": 955
  },
  {
    "id": 19,
    "title": "Black Clover Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/6/69/Black_Clover%2C_volume_1.jpg",
    "publisher": "Shueisha",
    "characters": ["Asta", "Yuno"],
    "genre": "Fantasy",
    "release_date": "2021-07-15",
    "description": "In a world where magic is everything, Asta and Yuno are two orphans raised together in a church on the outskirts of the Clover Kingdom. While Yuno is a magical prodigy gifted with a powerful four-leaf clover grimoire, Asta is born completely devoid of magic. Despite his disadvantage, Asta possesses immense physical strength and a unique five-leaf clover grimoire containing a demon. The two boys make a vow to compete to become the Wizard King, the strongest magic knight in the kingdom, setting out on a journey to prove that even a magicless boy can rise to the top.",
    "price": 787
  },
  {
    "id": 20,
    "title": "Chainsaw Man Vol. 6",
    "poster_url": "https://m.media-amazon.com/images/I/51iWXuBAdFL._SY445_SX342_FMwebp_.jpg",
    "publisher": "Shueisha",
    "characters": ["Denji", "Power","Reze"],
    "genre": "Dark Fantasy",
    "release_date": "2022-10-20",
    "description": "Denji, the Chainsaw Man, finds his life further complicated by the appearance of Reze, a mysterious and charming girl who seemingly takes a genuine romantic interest in him. Their blossoming relationship offers Denji a fleeting taste of the normal life he yearns for, yet it comes at a dangerous time as foreign assassins are actively hunting him down. Denji soon discovers that Reze is far from an ordinary girl, forcing him to confront a complex emotional and physical battle that threatens to shatter his heart and his world.",
    "price": 912
  },
  {
    "id": 21,
    "title": "Boruto: Naruto Next Generations Vol. 1",
    "poster_url": "https://cmsapi-frontend.naruto-official.com/site/api/naruto/Image/get?path=/naruto/import/en/comics/boruto/1/cover.jpg",
    "publisher": "Shueisha",
    "characters": ["Boruto", "Sarada", "Mitsuki"],
    "genre": "Adventure",
    "release_date": "2019-03-11",
    "description": "Years after the events of *Naruto*, a new generation of ninja steps into the spotlight in the now peaceful and technologically advanced Hidden Leaf Village. Boruto Uzumaki, the son of the Seventh Hokage Naruto, resents his father for prioritizing the village over his family. Alongside Sasuke's daughter, Sarada Uchiha, and the mysterious Mitsuki, Boruto is part of the new Team 7, facing modern challenges, learning the true meaning of being a shinobi, and inadvertently becoming entangled in a fate that will link him to an ancient, cosmic threat.",
    "price": 829
  },
  {
    "id": 22,
    "title": "Tokyo Ghoul Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/51gTbdvr9tL._SY445_SX342_FMwebp_.jpg",
    "publisher": "Shueisha",
    "characters": ["Kaneki Ken", "Touka Kirishima"],
    "genre": "Horror",
    "release_date": "2017-10-05",
    "description": "Ken Kaneki, a shy college student, survives a deadly date with a mysterious girl, Rize Kamishiro, only to discover she is a Ghoul—a human-like creature that can only survive by eating human flesh. After a life-saving surgery, Kaneki wakes up to find he has been transformed into a half-ghoul, struggling to balance his human life with his new, inescapable hunger. He is taken in by a group of ghouls operating under the cover of a coffee shop called Anteiku, who teach him to survive in the gruesome, hidden underworld of Tokyo, where Ghouls are hunted by the Ghoul investigators of the CCG.",
    "price": 869
  },
  {
    "id": 23,
    "title": "Haikyuu!! Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/6/6b/Haiky%C5%AB_Volume_1.jpg",
    "publisher": "Shueisha",
    "characters": ["Hinata Shoyo", "Kageyama"],
    "genre": "Sports",
    "release_date": "2018-05-12",
    "description": "Shoyo Hinata, inspired by a legendary volleyball player known as the 'Little Giant,' is determined to become a top volleyball player despite his short stature. After suffering a crushing defeat in his first and only middle school tournament, he enrolls at Karasuno High School, the Little Giant's alma mater. There, he is shocked to find his rival, the brilliant but arrogant setter Tobio Kageyama, also enrolled. Initially at odds, the two unlikely teammates must learn to put aside their differences and combine their explosive talents to restore Karasuno to its former glory.",
    "price": 705
  },
  {
    "id": 24,
    "title": "Death Note Vol. 1",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/6/6f/Death_Note_Vol_1.jpg",
    "publisher": "Shueisha",
    "characters": ["Light Yagami", "L"],
    "genre": "Thriller",
    "release_date": "2016-04-04",
    "description": "Bored but brilliant high school student Light Yagami discovers the Death Note, a mysterious black notebook dropped by a Shinigami (a god of death) named Ryuk. The notebook grants its user the ability to kill anyone simply by writing their name while picturing their face. Convinced he can rid the world of criminals and become the 'God of a New World,' Light begins a secret purge of lawbreakers. His actions draw the attention of the enigmatic and world-renowned detective known only as L, who begins a thrilling, high-stakes game of cat and mouse to uncover Light's identity, who the public has dubbed 'Kira.'",
    "price": 1078
  },
  {
    "id": 25,
    "title": "Blue Lock Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/51fTR3fdvbL._SY445_SX342_FMwebp_.jpg",
    "publisher": "Shueisha",
    "characters": ["Isagi Yoichi"],
    "genre": "Sports",
    "release_date": "2021-10-12",
    "description": "After a crushing defeat in the national high school soccer tournament, striker Yoichi Isagi is invited to join the 'Blue Lock' program. This radical and controversial program, led by the enigmatic coach Jinpachi Ego, aims to create the world's greatest, most egoistic striker to lead Japan to World Cup victory. Isagi and 299 other top high school strikers are gathered in a prison-like facility where they must compete in brutal, elimination-style training sessions. The stakes are immense: the winner will become the national team's ace, and the losers will be permanently banned from representing Japan in soccer.",
    "price": 829
  },
  {
    "id": 26,
    "title": "Spy x Family Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/41FE6cItm3L._SY445_SX342_FMwebp_.jpg",
    "publisher": "Shueisha",
    "characters": ["Loid Forger", "Anya Forger"],
    "genre": "Comedy",
    "release_date": "2020-05-05",
    "description": "Master spy Twilight, known for going undercover on dangerous missions for world peace, is given the ultimate assignment: Operation Strix. To infiltrate a rival nation's elite private school, he must 'get married and have a kid.' Not one to rely on others, Twilight quickly procures a wife and child for his fake family, the Forgers. What he doesn't know is that his adopted daughter, Anya, is a telepath, and the woman he agrees to marry, Yor, is a deadly assassin known as the Thorn Princess. Each of them is hiding their true identity, creating an action-packed comedy as they strive to live a 'normal' family life.",
    "price": 913
  },
  {
    "id": 27,
    "title": "Chainsaw Man Vol. 2",
    "poster_url": "https://m.media-amazon.com/images/I/81d2l2DsNmL._SY466_.jpg",
    "publisher": "Shueisha",
    "characters": ["Denji", "Makima"],
    "genre": "Dark Fantasy",
    "release_date": "2021-03-10",
    "description": "Now having fused with his pet devil Pochita, Denji becomes the notorious Chainsaw Man and officially joins the Public Safety Devil Hunters under the mysterious Makima. In order to achieve his simple, human goals, Denji must risk everything in a fight against increasingly dangerous and powerful devils. His first major mission takes him into a conflict with the Bat Devil, forcing him to fight alongside the fiend Power and his stern new mentor, all while navigating a brutal world where devils and humans constantly clash.",
    "price": 912
  },
  {
    "id": 28,
    "title": "Bleach Vol. 2",
    "poster_url": "https://m.media-amazon.com/images/I/81HTbFhUd9L._SY466_.jpg",
    "publisher": "Shueisha",
    "characters": ["Ichigo", "Rukia"],
    "genre": "Supernatural",
    "release_date": "2017-02-14",
    "description": "After reluctantly taking on the duties of a Soul Reaper, Ichigo Kurosaki begins his new, secret life of protecting the innocent from monstrous Hollows. When his towering, muscle-bound classmate Chad suddenly develops a mysterious scar and is accompanied by a talking parakeet imbued with a young boy's soul, Ichigo quickly suspects a powerful Hollow is involved. Ichigo is forced to confront the strongest spirit he has faced to date, learning that not every soul is bound for the Soul Society, especially if it's tainted with innocent blood.",
    "price": 769
  },
  {
    "id": 29,
    "title": "My Hero Academia Vol. 2",
    "poster_url": "https://dwgkfo5b3odmw.cloudfront.net/manga/thumbs/thumb-14293-MHA_02_web.jpg",
    "publisher": "Shueisha",
    "characters": ["Deku", "Bakugo"],
    "genre": "Superhero",
    "release_date": "2020-03-12",
    "description": "Getting into the prestigious U.A. High School was only the beginning of Izuku Midoriya's journey to becoming a superhero. The first-year students, including the competitive Katsuki Bakugo, all have amazing Quirks, but Midoriya, despite inheriting All Might's power of One For All, can barely control it without shattering his own body. He must now participate in the grueling Battle Trial—a combat exercise where the students face off as Heroes and Villains—where he must find a way to use his power effectively or risk being expelled by his ruthless teachers.",
    "price": 872
  },
  {
    "id": 30,
    "title": "Jujutsu Kaisen Vol. 2",
    "poster_url": "https://m.media-amazon.com/images/I/815taz8gMaL._SY466_.jpg",
    "publisher": "Shueisha",
    "characters": ["Yuji", "Nobara"],
    "genre": "Supernatural",
    "release_date": "2022-06-11",
    "description": "Yuji Itadori has joined the mysterious world of Jujutsu Sorcerers, but his apprenticeship is immediately thrown into danger when a special-grade cursed womb appears at a detention facility. Jujutsu High dispatches Itadori and his fellow first-years, Megumi and Nobara, to handle the situation. However, the curse they encounter is far stronger and more terrifying than they ever anticipated, forcing them to face a brutal battle for survival. Meanwhile, powerful curses with mysterious designs on Jujutsu High and Satoru Gojo begin to gather, posing a threat to the entire sorcerer world.",
    "price": 912
  },
  {
    "id": 31,
    "title": "Moon Knight: The Midnight Mission",
    "poster_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRins-xOP8bkJKKKzptm9aivduuH9ZYjkRLmnY_TPE2v7DJdiLb",
    "publisher": "Marvel",
    "characters": ["Moon Knight"],
    "genre": "Supernatural",
    "release_date": "2022-01-19",
    "description": "Attempting to atone for his past actions, Marc Spector has declared a portion of New York City his 'Midnight Mission,' dedicating himself to protecting all those who travel at night. Working out of a new high-tech base, the former mercenary is now a priest, therapist, and vigilante all in one, using his fractured identities to serve Khonshu in a more righteous manner. His new mission quickly brings him into conflict with a shadowy new foe and forces him to confront the startling return of the Olympian Gods to the mortal realm.",
    "price": 1200
  },
  {
    "id": 32,
    "title": "Venom: Lethal Protector",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/8/86/Venom_Lethal_Protector_no_1.jpg",
    "publisher": "Marvel",
    "characters": ["Venom"],
    "genre": "Horror",
    "release_date": "2021-09-09",
    "description": "Having reached an uneasy truce with Spider-Man, Eddie Brock relocates to San Francisco to begin a new life as an anti-hero. He attempts to uphold his agreement with Spider-Man to stop eating good people, opting instead to defend the helpless and serve as a 'Lethal Protector' for the city's hidden population of under-dwellers. However, a powerful organization and the sudden arrival of new, deadly symbiote offspring threaten to derail Eddie’s fragile new existence, forcing him to embrace the violent nature of the Venom symbiote.",
    "price": 1327
  },
  {
    "id": 33,
    "title": "Black Panther: A Nation Under Our Feet",
    "poster_url": "https://cdn.marvel.com/u/prod/marvel/i/mg/4/00/571e49e13973d/clean.jpg",
    "publisher": "Marvel",
    "characters": ["Black Panther"],
    "genre": "Superhero",
    "release_date": "2021-03-29",
    "description": "A new era for the Black Panther begins as the kingdom of Wakanda enters a period of dramatic political upheaval. King T'Challa must confront a superhuman terrorist group known as The People, who spark a violent uprising against the monarchy, aiming to liberate the nation from its long-standing traditions. As T'Challa grapples with this deep-seated rebellion and the spiritual absence of his sister Shuri, he is forced to question the true meaning of leadership and how to unite a nation poisoned against its king.",
    "price": 1328
  },
  {
    "id": 34,
    "title": "Deadpool Classic Vol. 1",
    "poster_url": "https://cdn.marvel.com/u/prod/marvel/i/mg/3/40/58d3e5b216712/portrait_uncanny.jpg",
    "publisher": "Marvel",
    "characters": ["Deadpool"],
    "genre": "Comedy",
    "release_date": "2020-10-10",
    "description": "He's the Merc with a Mouth, the Assassin with Elan, and the wryest wisecracker of the Weapon X Program, now collected in his earliest sagas. Deadpool, with his sidekick Weasel in tow, sets out on a quest for romance, money, and mayhem, only to learn he's being hunted by an enemy he thought he killed years before. This volume chronicles the chaotic start of Wade Wilson's journey, featuring classic encounters with the Juggernaut and the beautiful Siryn, who tries to inject a little sanity into the proceedings.",
    "price": 1159
  },
  {
    "id": 35,
    "title": "Wolverine: Weapon X",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/a/a2/Marvel_Comics_Presents_79.jpg",
    "publisher": "Marvel",
    "characters": ["Wolverine"],
    "genre": "Action",
    "release_date": "2020-12-30",
    "description": "This is the true, brutal origin story of Logan, detailing his agonizing ordeal within the notorious Weapon X program. Captured and subjected to horrifying experiments, Logan's skeleton is bonded with the indestructible metal Adamantium, transforming him into a living weapon with no memory of his past. The story plunges into the psychological and physical torture that created the Wolverine we know, revealing the savage struggle for his humanity against the cold machinery of his creators.",
    "price": 1079
  },
  {
    "id": 36,
    "title": "Avengers: Age of Ultron",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/8/81/Age-of-ultron-01.jpeg",
    "publisher": "Marvel",
    "characters": ["Iron Man", "Thor", "Hulk", "Captain America"],
    "genre": "Superhero",
    "release_date": "2019-09-14",
    "description": "New York is in ruins, and the world has been conquered by the sentient robot tyrant Ultron. Ultron Sentinels patrol the streets, searching for the few remaining human survivors and the scattered heroes who have gone into hiding. This dark future forces the Avengers to desperately search for a way to defeat Ultron. Their only hope may lie in the past, leading to a desperate, time-altering scheme that could change the fabric of reality itself to prevent Ultron's deadly conquest before it ever begins.",
    "price": 1494
  },
  {
    "id": 37,
    "title": "Guardians of the Galaxy Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/71Jn3WIAdXL._SY466_.jpg",
    "publisher": "Marvel",
    "characters": ["Star-Lord", "Gamora", "Rocket"],
    "genre": "Sci-Fi",
    "release_date": "2023-01-14",
    "description": "Once a team of misfits, the Guardians of the Galaxy have evolved into a family, but the universe is far from peaceful. With the great empires in turmoil and the rule of law collapsing, the ancient Gods of Olympus have mysteriously returned, acting as harbingers of a new age of cosmic war. Someone must step up to guard the galaxy, and this ragtag team of Star-Lord, Gamora, Rocket, and others reluctantly accepts the mission, finding themselves pitted against forces greater than any they have ever encountered.",
    "price": 1244
  },
  {
    "id": 38,
    "title": "Daredevil: The Man Without Fear",
    "poster_url": "https://cdn.marvel.com/u/prod/marvel/i/mg/f/40/4bb86394dbcca/portrait_uncanny.jpg",
    "publisher": "Marvel",
    "characters": ["Daredevil"],
    "genre": "Action",
    "release_date": "2018-07-08",
    "description": "This critically acclaimed series delves into the definitive origin of Matt Murdock, the blind hero of Hell's Kitchen. The narrative explores his childhood, the tragic murder of his boxer father, and the accident that granted him his superhuman senses. Trained by the mysterious Stick and later meeting his great love Elektra, Matt Murdock grapples with the complexities of his dual life as a committed lawyer and a masked vigilante, all while the shadow of the man who will become the Kingpin begins to fall over the city.",
    "price": 1037
  },
  {
    "id": 39,
    "title": "Hawkeye: My Life as a Weapon",
    "poster_url": "https://cdn.marvel.com/u/prod/marvel/i/mg/3/b0/51a515296fe75/portrait_uncanny.jpg",
    "publisher": "Marvel",
    "characters": ["Hawkeye", "Kate Bishop"],
    "genre": "Action",
    "release_date": "2017-11-10",
    "description": "Clint Barton, the Avenger known as Hawkeye, decides to take a break from saving the world and focus on the little guy, tackling street-level crime in his apartment building and neighborhood. Despite his lack of superpowers, his good intentions often land him in over his head, dealing with Russian mobsters, a mysterious bag of incriminating evidence, and a deadly femme fatale. With the help of his younger counterpart, Kate Bishop, Clint navigates this low-stakes, high-danger world, proving that he is a hero even when he's not fighting alongside the God of Thunder.",
    "price": 995
  },
  {
    "id": 40,
    "title": "Ms. Marvel Vol. 1: No Normal",
    "poster_url": "https://cdn.marvel.com/u/prod/marvel/i/mg/6/d0/53766b56a5fd4/portrait_uncanny.jpg",
    "publisher": "Marvel",
    "characters": ["Kamala Khan"],
    "genre": "Superhero",
    "release_date": "2022-04-18",
    "description": "Kamala Khan is an ordinary Muslim-American teenager from Jersey City who struggles with balancing her home life, her faith, and her fervent love for superheroes, particularly Captain Marvel. Her life changes dramatically when she is suddenly exposed to a strange mist and emerges with extraordinary shapeshifting powers. As she grapples with her newfound abilities and the responsibility that comes with them, Kamala decides to take up the mantle of Ms. Marvel, becoming a groundbreaking heroine for a new generation.",
    "price": 1079
  },
  {
    "id": 41,
    "title": "Green Lantern: Rebirth",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/b/b0/Green_Lantern-Rebirth_%28collection%29.png",
    "publisher": "DC",
    "characters": ["Hal Jordan"],
    "genre": "Sci-Fi",
    "release_date": "2018-03-12",
    "description": "After years of being possessed by the cosmic fear entity Parallax, which led him to destroy the Green Lantern Corps, Hal Jordan's soul is finally free. But the threat of Parallax is not yet defeated, and Hal's return to the world is met with skepticism from his former allies. This series chronicles Hal's fight to overcome fear itself, reclaim his place as the greatest Green Lantern of all time, and unravel the decades-long mystery of the yellow impurity, setting the stage for the true return of the Green Lantern Corps.",
    "price": 1246
  },
  {
    "id": 42,
    "title": "Teen Titans Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/91Of9ub9i5L._SL1500_.jpg",
    "publisher": "DC",
    "characters": ["Robin", "Starfire", "Raven", "Beast Boy"],
    "genre": "Action",
    "release_date": "2020-09-01",
    "description": "A new generation of young heroes, including Robin, Starfire, Raven, and Beast Boy, forms a contemporary team to face the threats of the modern world. This new iteration of the Teen Titans must learn to work together despite their dramatically different backgrounds and powers, tackling everything from street-level crises to global conspiracies. Their first challenge tests their limits as they struggle to define what it means to be a hero outside the shadow of the Justice League.",
    "price": 1161
  },
  {
    "id": 43,
    "title": "Justice League: Origin",
    "poster_url": "https://upload.wikimedia.org/wikipedia/en/0/0e/Brave_bold_28.jpg",
    "publisher": "DC",
    "characters": ["Superman", "Batman", "Flash", "Wonder Woman"],
    "genre": "Superhero",
    "release_date": "2022-12-15",
    "description": "In a world where superheroes are inexperienced loners and viewed with public suspicion, Batman stumbles upon a dark alien evil that threatens to destroy the Earth. This catastrophic threat forces the world's greatest metahumans—including Superman, Wonder Woman, Green Lantern, and The Flash—to grudgingly unite for the first time. They must overcome their differences and forge themselves into a cohesive force to repel the invasion, marking the legendary origin of the Justice League.",
    "price": 1327
  },
  {
    "id": 44,
    "title": "Harley Quinn: Hot in the City",
    "poster_url": "https://m.media-amazon.com/images/I/81Flo2FBkOL._SY466_.jpg",
    "publisher": "DC",
    "characters": ["Harley Quinn"],
    "genre": "Comedy",
    "release_date": "2020-07-03",
    "description": "Freshly emancipated from the Joker, Harley Quinn embarks on a completely chaotic new life after receiving a mysterious, lucrative inheritance in Coney Island. She quickly finds herself becoming a roller derby queen and dealing with a motley crew of new neighbors, all while trying to maintain some semblance of a criminal career. This series follows Harley as she navigates her bizarre, violent, and hilarious new reality, proving she can be a self-made villain and a force of nature all on her own.",
    "price": 1038
  },
  {
    "id": 45,
    "title": "Supergirl: Woman of Tomorrow",
    "poster_url": "https://m.media-amazon.com/images/I/81WCblz7GnL._SY466_.jpg",
    "publisher": "DC",
    "characters": ["Supergirl"],
    "genre": "Sci-Fi",
    "release_date": "2021-05-14",
    "description": "Following a devastating tragedy, Kara Zor-El—Supergirl—is struggling to find her place in the universe. Her emotional cosmic journey begins when a ruthless killer is responsible for the death of a young girl’s entire planet. Vowing vengeance, Supergirl takes the girl on an epic, star-spanning quest for justice, pushing her to the edges of the universe and forcing her to confront profound questions about life, loss, and the true meaning of the Superman legacy.",
    "price": 1201
  },
  {
    "id": 46,
    "title": "Batman Beyond: Neo Year",
    "poster_url": "https://m.media-amazon.com/images/I/81DeVxn19nL._SY466_.jpg",
    "publisher": "DC",
    "characters": ["Terry McGinnis"],
    "genre": "Sci-Fi",
    "release_date": "2023-08-03",
    "description": "Neo-Gotham, the futuristic city Terry McGinnis has sworn to protect, is now alive and has rejected him as Batman following the death of Bruce Wayne. The city, controlled by a powerful digital consciousness, is actively trying to destroy Terry's life and the legacy of Batman, even creating brand-new, technological villains to hunt him down. Terry must embark on his first year without his mentor, facing an impossible digital threat that demands he evolve beyond everything Bruce Wayne taught him if he hopes to survive.",
    "price": 1327
  },
  {
    "id": 47,
    "title": "Shazam!: The New Beginning",
    "poster_url": "https://m.media-amazon.com/images/I/51r3qDKlyhL._SY445_SX342_FMwebp_.jpg",
    "publisher": "DC",
    "characters": ["Shazam"],
    "genre": "Superhero",
    "release_date": "2018-06-22",
    "description": "Following a crisis that reshaped the multiverse, the definitive origin of Billy Batson is retold. Billy is granted the power to transform into the godly champion Shazam by an ancient wizard. As he learns to control his incredible abilities, he must face his first major threat: the sudden return of Black Adam, an ancient, powerful enemy with identical abilities. Billy must quickly understand the responsibilities of his power to defeat Black Adam and prevent the destruction of his city.",
    "price": 995
  },
  {
    "id": 48,
    "title": "Nightwing: Better Than Batman",
    "poster_url": "https://m.media-amazon.com/images/I/51mXVvGCzLL._SY445_SX342_FMwebp_.jpg",
    "publisher": "DC",
    "characters": ["Nightwing"],
    "genre": "Action",
    "release_date": "2022-03-19",
    "description": "Dick Grayson, the original Robin, is back in Blüdhaven and attempting to reclaim the life that was taken from him. However, when a dark, global conspiracy known as the Parliament of Owls threatens to expose secrets and endanger those closest to him, Dick is forced to put aside his new life. He dons the Nightwing mantle once more to combat this dark force, proving that he is a distinct hero capable of stepping out of Batman's shadow and being 'Better Than Batman.'",
    "price": 1119
  },
  {
    "id": 49,
    "title": "Catwoman: Lonely City",
    "poster_url": "https://m.media-amazon.com/images/I/81dQ12U0WdL._SY385_.jpg",
    "publisher": "DC",
    "characters": ["Catwoman"],
    "genre": "Crime",
    "release_date": "2022-11-12",
    "description": "Ten years after the devastating 'Fools' Night' tragedy claimed the lives of Batman, The Joker, and Commissioner Gordon, Selina Kyle is finally released from prison. She returns to a vastly changed Gotham—cleaner, safer, but less free under the watchful, authoritarian eye of Mayor Harvey Dent and his 'Batcops.' Selina, a changed woman, is obsessed with one last big score: uncovering the secrets hidden inside the locked-up Batcave and finding the mysterious person known only as 'Orpheus.'",
    "price": 1328
  },
  {
    "id": 50,
    "title": "Superman: Action Comics Vol. 1",
    "poster_url": "https://m.media-amazon.com/images/I/81jnNvLxl4L._SY466_.jpg",
    "publisher": "DC",
    "characters": ["Superman"],
    "genre": "Superhero",
    "release_date": "2023-01-15",
    "description": "The Man of Steel continues his legendary legacy, defending Metropolis and the world from new cosmic threats that challenge his immense power and moral core. As he balances his life as Clark Kent and his role as Earth's protector, Superman must confront unexpected enemies and allies, all while cementing his place as the ultimate symbol of hope and truth in a constantly evolving universe.",
    "price": 1493
  }
]
